NextFOAM-2602/tutorials/lagrangian/reactingParcelFoam/liquidFilmStepWithSprinklers/system/finite-area/faSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    Uf_film
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.0;
    }

    hf_film
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.0;
    }
}

PIMPLE
{
    momentumPredictor true;
    nOuterCorr        4;
    nCorr             1;
    nNonOrthCorr      0;
    nFilmCorr         1;
}

relaxationFactors
{
    hf_Film    1;
    Uf_Film    1;
}


// ************************************************************************* //
